<?php
/**
 * Created by PhpStorm.
 * User: lexi
 * Date: 30.01.18
 * Time: 21:45
 */

class ЗаймоКарп extends Рыба
{
    public $скорость = 7;
    public $сытость = 8;
    private $режимСозерцания = false;

    public function неГотоваСкушатьОрешек(Орешек $орешек)
    {
        /*Если вдрук Карп в режиме созерцания то орешек не кушает пока не стукнет 5 тактов*/
        if (!$this->режимСозерцания && mt_rand(1, 100) <= 30 ) $this->режимСозерцания = true;
        if($this->режимСозерцания){
            $орешек->выбранРыбкой = true;
            return $this->времяСозерцанияОрешка < 5;
        } else {
            $this->режимСозерцания = false;
            return parent::неГотоваСкушатьОрешек($орешек);
        }
    }



}